import img1 from "../../public/docors/1.webp";
import img2 from "../../public/docors/2.webp";
import img3 from "../../public/docors/3.webp";
import img4 from "../../public/docors/4.webp";
import img5 from "../../public/docors/5.webp";
import img6 from "../../public/docors/6.webp";
import img7 from "../../public/docors/7.webp";
import img8 from "../../public/docors/8.webp";
import img9 from "../../public/docors/9.webp";
import img10 from "../../public/docors/10.webp";
import Slider from "@/components/ImageSlider/Slider";

const images = [
  {
    original: img3.src,
    thumbnail: img3.src,
  },
  {
    original: img4.src,
    thumbnail: img4.src,
  },
  {
    original: img9.src,
    thumbnail: img9.src,
  },
  {
    original: img10.src,
    thumbnail: img10.src,
  },
  {
    original: img5.src,
    thumbnail: img5.src,
  },
  {
    original: img6.src,
    thumbnail: img6.src,
  },
  {
    original: img7.src,
    thumbnail: img7.src,
  },
  {
    original: img8.src,
    thumbnail: img8.src,
  },
  {
    original: img1.src,
    thumbnail: img1.src,
  },
  {
    original: img2.src,
    thumbnail: img2.src,
  },
];
export const metadata = {
  title:
    "ديكورات | معلم لياسه معلم ديكور جيبس بورد | أفضل شركة ديكورات في السعودية",
  description:
    "أفضل خدمات الديكورات الداخلية والخارجية في السعودية. معلم لياسه، معلم ديكور جيبس بورد، تصميم وتركيب الديكورات الجبسية، تنسيق الألوان، اختيار الأثاث والإضاءة، حلول مبتكرة تلبي رغبات العملاء. خبرة في تنفيذ جميع أنواع الديكورات الحديثة والكلاسيكية بأعلى جودة وأسعار منافسة.",
  keywords: [
    "ديكورات داخلية جدة",
    "ديكورات داخلية مكة",
    "ديكورات خارجية جدة",
    "ديكورات خارجية مكة",
    "معلم لياسة بجدة",
    "معلم لياسة بمكة",
    "معلم دهانات جدة",
    "معلم دهانات مكة",
    "أعمال جبس بورد جدة",
    "أعمال جبس بورد مكة",
    "تصميم ديكور مودرن جدة",
    "تصميم ديكور مودرن مكة",
    "تصميم ديكور كلاسيك جدة",
    "تصميم ديكور كلاسيك مكة",
    "ديكورات أسقف جبس بورد جدة",
    "ديكورات أسقف جبس بورد مكة",
    "ديكورات جدران جبس جدة",
    "ديكورات جدران جبس مكة",
    "ديكورات رفوف جبس جدة",
    "ديكورات رفوف جبس مكة",
    "ديكورات جبس تلفزيون جدة",
    "ديكورات جبس تلفزيون مكة",
    "ديكورات مكتبات جبس جدة",
    "ديكورات مكتبات جبس مكة",
    "جبس بورد غرف نوم جدة",
    "جبس بورد غرف نوم مكة",
    "جبس بورد صالات جدة",
    "جبس بورد صالات مكة",
    "جبس بورد مطابخ جدة",
    "جبس بورد مطابخ مكة",
    "جبس بورد حمامات جدة",
    "جبس بورد حمامات مكة",
    "ديكورات جبس مجالس رجال جدة",
    "ديكورات جبس مجالس رجال مكة",
    "ديكورات جبس مجالس نساء جدة",
    "ديكورات جبس مجالس نساء مكة",
    "إضاءة مخفية جبس بورد جدة",
    "إضاءة مخفية جبس بورد مكة",
    "تصميم جبس بورد 2025 جدة",
    "تصميم جبس بورد 2025 مكة",
    "تركيب جبس بورد جدة",
    "تركيب جبس بورد مكة",
    "صيانة ديكورات جدة",
    "صيانة ديكورات مكة",
    "ديكورات ليزر جبس جدة",
    "ديكورات ليزر جبس مكة",
    "عقود ديكورات جدة",
    "عقود ديكورات مكة",
    "أسعار جبس بورد جدة",
    "أسعار جبس بورد مكة",
    "ديكورات واجهات منازل جدة",
    "ديكورات واجهات منازل مكة",
    "ديكورات عيادات جدة",
    "ديكورات عيادات مكة",
    "ديكورات مطاعم جدة",
    "ديكورات مطاعم مكة",
    "ديكورات كافيهات جدة",
    "ديكورات كافيهات مكة",
    "ديكورات مكاتب عمل جدة",
    "ديكورات مكاتب عمل مكة",
    "ديكورات استراحات جدة",
    "ديكورات استراحات مكة",
    "ديكورات معارض جدة",
    "ديكورات معارض مكة",
    "مقاول ديكورات جدة",
    "مقاول ديكورات مكة",
    "شركة تشطيبات جدة",
    "شركة تشطيبات مكة",
    "أحدث ديكورات جبس جدة",
    "أحدث ديكورات جبس مكة",
    "جبسيات جدة",
    "جبسيات مكة",
    "فن الديكور جدة",
    "فن الديكور مكة",
    "مهندس ديكور داخلي جدة",
    "مهندس ديكور داخلي مكة",
    "تنفيذ تصاميم ديكور جدة",
    "تنفيذ تصاميم ديكور مكة",
    "ديكورات داخلية حديثة جدة",
    "ديكورات داخلية حديثة مكة",
    "ديكورات خارجية حديثة جدة",
    "ديكورات خارجية حديثة مكة",
    "ديكورات داخلية كلاسيكية جدة",
    "ديكورات داخلية كلاسيكية مكة",
    "ديكورات داخلية جدة",
    "ديكورات داخلية مكة",
    "ديكورات خارجية جدة",
    "ديكورات خارجية مكة",
    "معلم لياسة بجدة",
    "معلم لياسة بمكة",
    "معلم دهانات جدة",
    "معلم دهانات مكة",
    "أعمال جبس بورد جدة",
    "أعمال جبس بورد مكة",
    "تصميم ديكور مودرن جدة",
    "تصميم ديكور مودرن مكة",
    "تصميم ديكور كلاسيك جدة",
    "تصميم ديكور كلاسيك مكة",
    "ديكورات أسقف جبس بورد جدة",
    "ديكورات أسقف جبس بورد مكة",
    "ديكورات جدران جبس جدة",
    "ديكورات جدران جبس مكة",
    "ديكورات رفوف جبس جدة",
    "ديكورات رفوف جبس مكة",
    "ديكورات جبس تلفزيون جدة",
    "ديكورات جبس تلفزيون مكة",
    "ديكورات مكتبات جبس جدة",
    "ديكورات مكتبات جبس مكة",
    "جبس بورد غرف نوم جدة",
    "جبس بورد غرف نوم مكة",
    "جبس بورد صالات جدة",
    "جبس بورد صالات مكة",
    "جبس بورد مطابخ جدة",
    "جبس بورد مطابخ مكة",
    "جبس بورد حمامات جدة",
    "جبس بورد حمامات مكة",
    "ديكورات جبس مجالس رجال جدة",
    "ديكورات جبس مجالس رجال مكة",
    "ديكورات جبس مجالس نساء جدة",
    "ديكورات جبس مجالس نساء مكة",
    "إضاءة مخفية جبس بورد جدة",
    "إضاءة مخفية جبس بورد مكة",
    "تصميم جبس بورد 2025 جدة",
    "تصميم جبس بورد 2025 مكة",
    "تركيب جبس بورد جدة",
    "تركيب جبس بورد مكة",
    "صيانة ديكورات جدة",
    "صيانة ديكورات مكة",
    "ديكورات ليزر جبس جدة",
    "ديكورات ليزر جبس مكة",
    "عقود ديكورات جدة",
    "عقود ديكورات مكة",
    "أسعار جبس بورد جدة",
    "أسعار جبس بورد مكة",
    "ديكورات واجهات منازل جدة",
    "ديكورات واجهات منازل مكة",
    "ديكورات عيادات جدة",
    "ديكورات عيادات مكة",
    "ديكورات مطاعم جدة",
    "ديكورات مطاعم مكة",
    "ديكورات كافيهات جدة",
    "ديكورات كافيهات مكة",
    "ديكورات مكاتب عمل جدة",
    "ديكورات مكاتب عمل مكة",
    "ديكورات استراحات جدة",
    "ديكورات استراحات مكة",
    "ديكورات معارض جدة",
    "ديكورات معارض مكة",
    "مقاول ديكورات جدة",
    "مقاول ديكورات مكة",
    "شركة تشطيبات جدة",
    "شركة تشطيبات مكة",
    "أحدث ديكورات جبس جدة",
    "أحدث ديكورات جبس مكة",
    "جبسيات جدة",
    "جبسيات مكة",
    "فن الديكور جدة",
    "فن الديكور مكة",
    "مهندس ديكور داخلي جدة",
    "مهندس ديكور داخلي مكة",
    "تنفيذ تصاميم ديكور جدة",
    "تنفيذ تصاميم ديكور مكة",
    "ديكورات خارجية كلاسيكية جدة",
    "ديكورات خارجية كلاسيكية مكة",
    "ديكورات داخلية فاخرة جدة",
    "ديكورات داخلية فاخرة مكة",
    "ديكورات خارجية فاخرة جدة",
    "ديكورات خارجية فاخرة مكة",
    "ديكورات داخلية بسيطة جدة",

    "ديكورات داخلية بسيطة مكة",
  ],
  openGraph: {
    title:
      "ديكورات | معلم لياسه معلم ديكور جيبس بورد | أفضل شركة ديكورات في السعودية",
    description:
      "أفضل خدمات الديكورات الداخلية والخارجية في السعودية. معلم لياسه، معلم ديكور جيبس بورد، تصميم وتركيب الديكورات الجبسية، تنسيق الألوان، اختيار الأثاث والإضاءة، حلول مبتكرة تلبي رغبات العملاء.",
    type: "website",
    url: "https://last-sepia-eight.vercel.app/decors",
    images: [
      {
        url: "/docors/2.webp",
        width: 800,
        height: 600,
        alt: "ديكورات داخلية وخارجية",
      },
    ],
  },
};
const page = () => {
  return (
    <main>
      <div className="text-center bg-primary text-light py-32 md:pb-40 md:pt-52">
        <h1 className="masked-text text-2xl md:text-5xl font-bold mb-4">
          ديكورات
        </h1>
        <p className="text-lg max-w-[70%] mx-auto leading-relaxed text-background">
          تقدم <strong className="text-secondary">سيف تاورز</strong> خدمات
          <strong> الديكورات الداخلية والخارجية</strong> لتحويل المساحات إلى
          أماكن مبهرة وفريدة من نوعها. تشمل خدماتنا{" "}
          <strong>
            {" "}
            تصميم وتركيب الديكورات الجبسية، تنسيق الألوان، اختيار الأثاث
            والإضاءة، وتقديم حلول مبتكرة
          </strong>{" "}
          تلبي رغبات العملاء. نعمل على تحقيق{" "}
          <strong>التوازن بين الجمال والوظيفة</strong> باستخدام أفضل المواد
          وأحدث التقنيات.
        </p>
        <div className="flex justify-center mt-4">
          <button
            aria-label="اتصل الآن"
            className="flex items-center text-green-600 font-heading hover:underline transition-all bg-green-50 px-4 py-2 rounded-lg hover:bg-green-100"
          >
            <a
              aria-label="اتصل بنا الآن"
              href={`tel:+966531955694`}
              target="_blank"
              rel="noopener noreferrer"
            >
              اتصل الآن
              <span> 📞</span>
            </a>
          </button>
        </div>
      </div>

      <Slider images={images} />
    </main>
  );
};

export default page;
